[
  {
    "pageId": 1,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 0.png",
        "text": "Ethan, woke up to a sunny morning. Rubbing his eyes, he wondered, 'I wonder if I could close my eyes for a few more minutes?' His room was cozy, and his bed felt extra comfortable.",
        "nextPage": 2
      }
    ]
  },
  {
    "pageId": 2,
    "type": "double",
    "contents": [
      {
        "imageSrc": "/story/boy 1.png",
        "text": "Ethan decided he better get up, he hopped out of bed ready for adventure. He quickly got ready, grabbed his backpack, and made his way to the bus stop. ",
        "nextPage": 3
      },
      {
        "imageSrc": "/story/boy 2.png",
        "text": "Ethan snuggled deeper into his bed, closing his eyes thinking he had a few more minutes. He dreamed of distant planets and daring escapes. But when he finally woke up, the room was bright with daylight. 'Oh no!' he thought, 'I've missed the bus!' Ethan rushed to get ready, but he knew he'd be late for class.",
        "nextPage": 5
      }
    ]
  },
  {
    "pageId": 3,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 4.png",
        "text": "Just in time! Ethan sat in his normal seat and gazed out the window, wondering what the day would bring.",
        "nextPage": 4
      }
    ]
  },
  {
    "pageId": 4,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 6.png",
        "text": "Walking into class, Ethan was greeted by his favorite teacher Mrs. Whitley. He took his seat ready for today's lessons",
        "nextPage": 7
      }
    ]
  },
  {
    "pageId": 5,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 3.png",
        "text": "Running after the bus he knew he wouldn't catch it. He slowed to a walk knowing that he had a long walk ahead of him.",
        "nextPage": 6
      }
    ]
  },
  {
    "pageId": 6,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 5.png",
        "text": "When he finally got to class, his teacher Mrs. Whitley was dissapointed in his tardiness and he sat in his seat sadly.",
        "nextPage": 7
      }
    ]
  },
  {
    "pageId": 7,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 9.png",
        "text": "The day went on and while he was working on a math problem, he looked out the window and something caught his eye, several black dots in the sky, growing larger. They were spaceships! The spacecraft landed in the playground, the school buzzed with excitement as everyone went out to meet the visitors. ",
        "nextPage": 8
      }
    ]
  },
  {
    "pageId": 8,
    "type": "double",
    "contents": [
      {
        "imageSrc": "/story/boy 10.png",
        "text": "Ethan didn't want to get too close and stayed near the back of the crowd surrounding the strange vehicle.",
        "nextPage": 9
      },
      {
        "imageSrc": "/story/boy meets aliens front.png",
        "text": "Ethan wanted to get as close as possible to get a good look at the aliens.",
        "nextPage": 9
      }
    ]
  },
  {
    "pageId": 9,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 12.png",
        "text": "One of the blue aliens approached the crowd and pointed at Ethan. Ethan stepped forward to meet the aliens. They hummed and buzzed, trying to communicate. Suddenly, Ethan heard their voices in his mind! They were telepathic! The aliens explained they had come for chicken nuggets, their favorite Earth delicacy. ",
        "nextPage": 10
      }
    ]
  },
  {
    "pageId": 10,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 13.png",
        "text": "Ethan asked how many they needed as it was one of his favorite foods too! When the alien said 'All Your Nuggets' Ethan froze. All? he asked ",
        "nextPage": 11
      }
    ]
  },
  {
    "pageId": 11,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy thinks about what to do.png",
        "text": "Ethan had to think hard to try and find a solution, as he couldn't let them have ALL their chicken nuggets.",
        "nextPage": 12
      }
    ]
  },
  {
    "pageId": 12,
    "type": "double",
    "contents": [
      {
        "imageSrc": "/story/boy 14.png",
        "text": "Ethan thought maybe the aliens would be open to sharing instead of taking all the nuggets. He rushed to the lunchroom to see if maybe they would be willing to share instead.",
        "nextPage": 13
      },
      {
        "imageSrc": "/story/boy 15.png",
        "text": "Ethan decided to challenge the leader to an arm wrestling competition, the winner would get all the nuggets. As Ethan grabbed the slightly slimy tentacle he began to push with all his might against the powerful alien tentacle",
        "nextPage": 15
      }
    ]
  },
  {
    "pageId": 13,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 16.png",
        "text": "Ethan took one nugget and handed it to the alien and took one himself and held it to his mouth to see if the alien understood. Ethan held his breath, but after a few seconds the alien smiled and took a bite. They all ate together and had a great day playing on the playground.",
        "nextPage": 14
      }
    ]
  },
  {
    "pageId": 14,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy waving goodbye.png",
        "text": "The final bell rang and all the aliens returned to their ships and said goodbye, Ethan stood waving and hoping next time he can maybe visit their school and try their lunches",
        "nextPage": 17
      }
    ]
  },
  {
    "pageId": 15,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy wins.png",
        "text": "Before he knew it, he felt his hand hit the table as he pushed the alien tentacle to the table and won. Ethan decided sharing was much better than keeping all the nuggets for himself so he shared his hot crunchy chicken nuggets with his new friends. They all ate together and had a great day playing on the playground.",
        "nextPage": 16
      }
    ]
  },
  {
    "pageId": 16,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy waving goodbye.png",
        "text": "The final bell rang and all the aliens returned to their ships and said goodbye, Ethan stood waving and hoping next time he can maybe visit their school and try their lunches",
        "nextPage": 17
      }
    ]
  },
  {
    "pageId": 17,
    "type": "single",
    "contents": [
      {
        "imageSrc": "/story/boy 0.png",
        "text": "The End",
        "nextPage": null
      }
    ]
  },
  {
    "pageId": 18,
    "type": "end",
    "contents": [
      {
        "imageSrc": "/story/boy 0.png",
        "text": "The End",
        "nextPage": null
      }
    ]
  }
]
